УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ПоискЗакупок/КонтурЗакупки_ПоискЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурЗакупки_ПоискЗакупок</name>
  <attributes>
    <name>Авансирование223</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Авансирование44</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьЗакупкиБезНМЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленныеИсключенныеЗаказчики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписейВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписейНаСтраницу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсключаемыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяЦенаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяЦенаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоДокументам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреимуществаСМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораВсе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораДругиеСпособы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗакупкаУЕдинственногоПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗапросИлиМониторингЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗапросКотировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораКонкурс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЭлектронныйАукцион</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраницаТекущая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраницВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов223ФЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов44ФЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов615ПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговКоммерческиеИМалые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочныйПоиск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЗавершены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапОтменены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПланируются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПодачаЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапРаботаКомиссии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапТолькоНесостоявшиеся</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПоиска</name>
    <type>
      <types>CatalogRef.КонтурЗакупки_ШаблоныПоиска</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДоТекущейДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВРегламентномЗадании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьЗагрузкуЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговКоммерческие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговМалые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериодаОффлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаОффлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПоискаОффлайн</name>
    <type>
      <types>CatalogRef.КонтурЗакупки_ШаблоныПоиска</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказчики</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОГРН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакупкиНаЗагрузку</name>
    <attributes>
      <name>ИдентификаторЗакупки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отрасли</name>
    <attributes>
      <name>Отрасль</name>
      <type>
        <types>CatalogRef.КонтурЗакупки_Отрасли</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтраслиОбновленные</name>
    <attributes>
      <name>Отрасль</name>
      <type>
        <types>CatalogRef.КонтурЗакупки_ОтраслиОбновленные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Площадки</name>
    <attributes>
      <name>Площадка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПлощадки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Регионы</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРегиона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПоиска</name>
    <attributes>
      <name>ИдентификаторЗакупки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗакупкиНаЭТП</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтбора</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗакупки</name>
      <type>
        <types>EnumRef.КонтурЗакупки_ТипыЗакупки</types>
      </type>
    </attributes>
    <attributes>
      <name>НМЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаЭТП</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаКЗ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПодачиЗаявок</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупкаОтменена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПубликации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеЗакупки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаЗагруженный</name>
      <type>
        <types>DocumentRef.КонтурЗакупки_Закупка</types>
      </type>
    </attributes>
    <attributes>
      <name>ИННЗаказчиковИОрганизаторов</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МестаПоставки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сниппеты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СниппетыДляОтображения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Участники</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодведенияИтогов</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупкаНеСостоялась</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупкаПланируется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УчастникиКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сниппеты</name>
    <attributes>
      <name>ИдентификаторЗакупки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сниппет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ПоискЗакупок/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Найти закупки.
// 
// Параметры:
//  СтраницаЗначение - Число -  Страница значение
//  ОписаниеРезультата - Строка -  Возврат описание результата
// 
// Возвращаемое значение:
//  Булево -  Результат найти закупки
Функция НайтиЗакупки(СтраницаЗначение = 1, ОписаниеРезультата = "") Экспорт
	Результат = Истина;
	РезультатыПоиска.Очистить();

	СтруктураПоиска = ПолучитьСтруктуруПоиска(СтраницаЗначение);


	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьДанныеПоиска(СтруктураПоиска);
	Если Не РезультатHTTPЗапроса = Неопределено Тогда
		Если Не РезультатHTTPЗапроса["data"] = Неопределено Тогда
			ДанныеПоиска = РезультатHTTPЗапроса["data"];
			ЗаполнитьТабличнуюЧастьРезультата(ДанныеПоиска);
		ИначеЕсли Не РезультатHTTPЗапроса["error"] = Неопределено И РезультатHTTPЗапроса["error"] = Истина Тогда
			Результат = Ложь;
			ОписаниеРезультата = ОписаниеРезультата + СтрШаблон(
			НСтр("ru = 'Ошибка: %1'"), РезультатHTTPЗапроса["message"]) + Символы.ПС;
		КонецЕсли;
	Иначе
		Результат = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Ошибка'") + Символы.ПС;
	КонецЕсли;

	Возврат Результат
КонецФункции

// Заполнить поиск по шаблону.
Процедура ЗаполнитьПоискПоШаблону() Экспорт

	СписокИгнорируемыхРеквизитов = "Отрасли, ОтраслиОбновленные, Заказчики, Площадки, Регионы";

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ШаблонПоиска, , СписокИгнорируемыхРеквизитов);
	Если ШаблонПоиска.ТипТорговКоммерческиеИМалые Тогда
		ТипТорговКоммерческие = Истина;
		ТипТорговМалые = Истина;
	КонецЕсли;

	ОписаниеТипаСтрока10 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10));

	ТЗШаблона = ШаблонПоиска.Заказчики.Выгрузить();
	Если ТЗШаблона.Колонки.Найти("ДействиеСоСтрокой") = Неопределено Тогда
		ТЗШаблона.Колонки.Добавить("ДействиеСоСтрокой", ОписаниеТипаСтрока10);
	КонецЕсли;
	ТЗШаблона.ЗаполнитьЗначения("Удалить", "ДействиеСоСтрокой");
	Заказчики.Загрузить(ТЗШаблона);

	ТЗШаблона = ШаблонПоиска.Площадки.Выгрузить();
	Если ТЗШаблона.Колонки.Найти("ДействиеСоСтрокой") = Неопределено Тогда
		ТЗШаблона.Колонки.Добавить("ДействиеСоСтрокой", ОписаниеТипаСтрока10);
	КонецЕсли;
	ТЗШаблона.ЗаполнитьЗначения("Удалить", "ДействиеСоСтрокой");
	Площадки.Загрузить(ТЗШаблона);

	ТЗШаблона = ШаблонПоиска.Регионы.Выгрузить();
	Если ТЗШаблона.Колонки.Найти("ДействиеСоСтрокой") = Неопределено Тогда
		ТЗШаблона.Колонки.Добавить("ДействиеСоСтрокой", ОписаниеТипаСтрока10);
	КонецЕсли;
	ТЗШаблона.ЗаполнитьЗначения("Удалить", "ДействиеСоСтрокой");
	Регионы.Загрузить(ТЗШаблона);

	Отрасли.Загрузить(ШаблонПоиска.Отрасли.Выгрузить());
	ОтраслиОбновленные.Загрузить(ШаблонПоиска.ОтраслиОбновленные.Выгрузить());
	НачалоПериода = КонтурЗакупки_СлужебныеКлиентСервер.ДобавитьДней(КонецПериода, -1 * КоличествоДнейДоТекущейДаты);

КонецПроцедуры

// Выбрать все не загруженные на странице.
Процедура ВыбратьВсеНеЗагруженныеНаСтранице() Экспорт
	Для Каждого СтрокаТЧ Из РезультатыПоиска Цикл
		Если Не СтрокаТЧ.Загружен Тогда
			СтрокаТЧ.Загружать = Истина;
			НовСтрокаНаЗагрузку = ЗакупкиНаЗагрузку.Добавить();
			НовСтрокаНаЗагрузку.ИдентификаторЗакупки = СтрокаТЧ.ИдентификаторЗакупки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Получить массив идентификаторов закупок на загрузку.
// 
// Возвращаемое значение:
//  Массив из Строка - Массив идентификаторов закупок на загрузку
Функция ПолучитьМассивИдентификаторовЗакупокНаЗагрузку() Экспорт
	МассивИдентификаторовЗакупок = Новый Массив;
	Для Каждого СтрокаЗакупкиНаЗагрузку Из ЗакупкиНаЗагрузку Цикл
		МассивИдентификаторовЗакупок.Добавить(СтрокаЗакупкиНаЗагрузку.ИдентификаторЗакупки);
	КонецЦикла;
	Возврат МассивИдентификаторовЗакупок;
КонецФункции

// Загрузить закупки по списку.
// 
// Параметры:
//  ОписаниеРезультата - Строка - Возвращает описание результата
Процедура ЗагрузитьЗакупкиПоСписку(ОписаниеРезультата = "") Экспорт
	ОбработкаЗагрузки = Обработки.КонтурЗакупки_ДанныеЗакупки.Создать();
	МассивИдентификаторовЗакупок = ПолучитьМассивИдентификаторовЗакупокНаЗагрузку();
	Для Каждого ИдентификаторЗакупки Из МассивИдентификаторовЗакупок Цикл
		ЗагрузитьЗакупкуПоИдентификатору(ИдентификаторЗакупки, ОбработкаЗагрузки, ОписаниеРезультата);
	КонецЦикла;

	ЗакупкиНаЗагрузку.Очистить();
КонецПроцедуры

// Загрузить закупку по идентификатору.
// 
// Параметры:
//  ИдентификаторЗакупки - Строка - Идентификатор закупки
//  ОбработкаЗагрузки - ОбработкаОбъект.КонтурЗакупки_ДанныеЗакупки -  Обработка загрузки
//  ОписаниеРезультата - Строка - Возвращает описание результата
Процедура ЗагрузитьЗакупкуПоИдентификатору(Знач ИдентификаторЗакупки, Знач ОбработкаЗагрузки = Неопределено,
	ОписаниеРезультата = "") Экспорт
	Если ОбработкаЗагрузки = Неопределено Тогда
		ОбработкаЗагрузки = Обработки.КонтурЗакупки_ДанныеЗакупки.Создать();
	КонецЕсли;
	ОбработкаЗагрузки.ИдентификаторЗакупки = ИдентификаторЗакупки;
	ОбработкаЗагрузки.ПолучитьДанныеЗакупки(,ОписаниеРезультата);
КонецПроцедуры

// Заполнить табличную часть результата.
// 
// Параметры:
//  ДанныеПоиска - ТаблицаЗначений - Данные поиска
Процедура ЗаполнитьТабличнуюЧастьРезультата(ДанныеПоиска) Экспорт
	ЗаписейВсего = ДанныеПоиска["TotalCount"];
	СтраницаТекущая = ДанныеПоиска["PageNumber"] + 1;

	Если Не ДанныеПоиска["Items"] = Неопределено Тогда
		МассивЗакупок = ДанныеПоиска["Items"];
		Для Каждого ЭлементЗакупка Из МассивЗакупок Цикл

			СтрукРезультата = Новый Структура;
			СтрукРезультата.Вставить("ИдентификаторЗакупки", ЭлементЗакупка["Id"]);
			СтрукРезультата.Вставить("НомерЗакупкиНаЭТП", ЭлементЗакупка["NotificationNumber"]);
			СтрукРезультата.Вставить("НазваниеЗакупки", ИзменитьТегиНазванияЗакупкиИСниппетов(
					ЭлементЗакупка["OrderName"]));
			СтрукРезультата.Вставить("СпособОтбора", ЭлементЗакупка["NotificationTypeDesc"]);
			Попытка
				СтрукРезультата.Вставить("ТипЗакупки", Перечисления.КонтурЗакупки_ТипыЗакупки["_" + XMLСтрока(
						ЭлементЗакупка["TypeOfTrading"])]);
			Исключение
				СтрукРезультата.Вставить("ТипЗакупки", Перечисления.КонтурЗакупки_ТипыЗакупки.ПустаяСсылка());
			КонецПопытки;
			СтрукРезультата.Вставить("НМЦ", ЭлементЗакупка["MaxPrice"]);
			СтрукРезультата.Вставить("Валюта", ЭлементЗакупка["Currency"]);
			СтрукРезультата.Вставить("СсылкаНаЭТП", ЭлементЗакупка["EpUri"]);
			СтрукРезультата.Вставить("СсылкаНаКЗ", ЭлементЗакупка["Link"]);
			СтрукРезультата.Вставить("ДатаОкончанияПодачиЗаявок", КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(
					ЭлементЗакупка["ApplicationDeadline"], "GMT+3"));
			СтрукРезультата.Вставить("ЗакупкаОтменена", ЭлементЗакупка["IsCancelled"]);
			СтрукРезультата.Вставить("ДатаПубликации", КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(
					ЭлементЗакупка["CreateDate"], ЧасовойПоясСеанса()));
			СтрукРезультата.Вставить("СпособОтбора", ЭлементЗакупка["NotificationTypeDesc"]);
			Если Не ЭлементЗакупка["DeliveryPlaces"] = Неопределено И ТипЗнч(ЭлементЗакупка["DeliveryPlaces"]) = Тип(
					"Массив") Тогда
				СтрукРезультата.Вставить("МестаПоставки", СтрСоединить(ЭлементЗакупка["DeliveryPlaces"], ","));
			КонецЕсли;
			Если Не ЭлементЗакупка["Inns"] = Неопределено И ТипЗнч(ЭлементЗакупка["Inns"]) = Тип("Массив") Тогда
				//СтрукРезультата.Вставить("ИННЗаказчиковИОрганизаторов", СтрСоединить(ЭлементЗакупка["Inns"], ","));
				СтрукРезультата.Вставить("ИННЗаказчиковИОрганизаторов", ПредставлениеЗаказчиковПоМассивуИНН(ЭлементЗакупка["Inns"]));
			КонецЕсли; 

			Если Не ЭлементЗакупка["Snippets"] = Неопределено И ТипЗнч(ЭлементЗакупка["Snippets"]) = Тип("Массив") Тогда
				СниппетыСтрокой = СтрСоединить(ЭлементЗакупка["Snippets"], ";");
				СниппетыДляОтображения = ИзменитьТегиНазванияЗакупкиИСниппетов(СниппетыСтрокой, "*");

				СтрукРезультата.Вставить("Сниппеты", СниппетыСтрокой);
				СтрукРезультата.Вставить("СниппетыДляОтображения", СниппетыДляОтображения);
				СтрукРезультата.Вставить("МассивСниппеты", ЭлементЗакупка["Snippets"]);
			КонецЕсли;

			Если Не ЭлементЗакупка["Participants"] = Неопределено И ТипЗнч(ЭлементЗакупка["Participants"]) = Тип(
				"Массив") Тогда
				СтрукРезультата.Вставить("Участники", КонтурЗакупки_СлужебныеВызовСервера.СериализаторМассивВСтроку(
					ЭлементЗакупка["Participants"]));
				СтрукРезультата.Вставить("УчастникиКоличество", ЭлементЗакупка["Participants"].Количество());
			КонецЕсли;
			СтрукРезультата.Вставить("ДатаПодведенияИтогов", КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(
					ЭлементЗакупка["CommissionDeadline"], "GMT+3"));
			СтрукРезультата.Вставить("ЗакупкаНеСостоялась", ЭлементЗакупка["IsAbandoned"]);
			СтрукРезультата.Вставить("ЗакупкаПланируется", ЭлементЗакупка["IsPlanning"]);

			СтрукРезультата.Вставить("Загружать", ЗакупкаНаЗагрузку(СтрукРезультата.ИдентификаторЗакупки));
			СтрукЗагружена = КонтурЗакупки_РаботаСЗакупкамиСервер.ЗакупкаЗагружена(
					СтрукРезультата.ИдентификаторЗакупки);
			Для Каждого ЭлСтрукЗагружена Из СтрукЗагружена Цикл
				СтрукРезультата.Вставить(ЭлСтрукЗагружена.Ключ, ЭлСтрукЗагружена.Значение);
			КонецЦикла;

			СтрукРезультата.Вставить("ШаблонПоиска", ШаблонПоиска);

			ЗаполнитьСтрокуРезутьтата(СтрукРезультата);
			ДобавитьЗаписьРегистраСоханенныеРезультатыПоиска(СтрукРезультата);
		КонецЦикла;

		ЗаписейНаСтраницу = Макс(МассивЗакупок.Количество(), 1);
	КонецЕсли;

	СтраницВсего = Цел(ЗаписейВсего / ЗаписейНаСтраницу) + ?((ЗаписейВсего % ЗаписейНаСтраницу) > 0, 1, 0);
КонецПроцедуры

// Получить структуру поиска.
// 
// Параметры:
//  СтраницаЗначение - Число - Страница значение
// 
// Возвращаемое значение:
//  Соответствие из Неопределено - Получить структуру поиска
Функция ПолучитьСтруктуруПоиска(СтраницаЗначение = 1) Экспорт
	МассивОтраслей = ПолучитьМассивОтраслей();
	МассивОтраслейОбновленных = ПолучитьМассивОтраслейОбновленных();
	МассивКлючевыхСлов = КонтурЗакупки_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
			КлючевыеСлова, , Истина, Истина);
	МассивИсключаемыхСлов = КонтурЗакупки_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
			ИсключаемыеСлова, , Истина, Истина);
	МассивИдентификаторовРегионов = Регионы.Выгрузить( , "ИдентификаторРегиона").ВыгрузитьКолонку(
		"ИдентификаторРегиона");
	МассивЭтапов = ПолучитьМассивЭтапов();
	МассивТиповТоргов = ПолучитьМассивТиповТоргов();
	МассивЗаказчиков = Заказчики.Выгрузить( , "ИНН").ВыгрузитьКолонку("ИНН");
	МассивСпособовОтбора = ПолучитьМассивСпособовОтбора();
	МассивИдентификаторовПлощадок = Площадки.Выгрузить( , "ИдентификаторПлощадки").ВыгрузитьКолонку(
		"ИдентификаторПлощадки");

	Результат = Новый Соответствие;

	Результат.Вставить("text", ?(МассивКлючевыхСлов.Количество() > 0, МассивКлючевыхСлов, Неопределено));
	Результат.Вставить("strictSearch", ТочныйПоиск);
	Результат.Вставить("attachments", ПоискПоДокументам);
	Результат.Вставить("exclude", ?(МассивИсключаемыхСлов.Количество() > 0, МассивИсключаемыхСлов, Неопределено));
	Результат.Вставить("regionIds", ?(МассивИдентификаторовРегионов.Количество() > 0, МассивИдентификаторовРегионов,
		Неопределено));
	Результат.Вставить("categories", ?(МассивОтраслей.Количество() > 0, МассивОтраслей, Неопределено));
	Результат.Вставить("CategoryIds", ?(МассивОтраслейОбновленных.Количество() > 0, МассивОтраслейОбновленных,
		Неопределено));
	Результат.Вставить("purchaseStatuses", ?(МассивЭтапов.Количество() > 0, МассивЭтапов, Неопределено));
	Результат.Вставить("laws", ?(МассивТиповТоргов.Количество() > 0, МассивТиповТоргов, Неопределено));
	Результат.Вставить("includeInns", ?(МассивЗаказчиков.Количество() > 0 И ДобавленныеИсключенныеЗаказчики = 0,
		МассивЗаказчиков, Неопределено));
	Результат.Вставить("excludeInns", ?(МассивЗаказчиков.Количество() > 0 И ДобавленныеИсключенныеЗаказчики = 1,
		МассивЗаказчиков, Неопределено));
	Результат.Вставить("procedures", ?(МассивСпособовОтбора.Количество() > 0, МассивСпособовОтбора, Неопределено));
	Результат.Вставить("electronicPlaces", ?(МассивИдентификаторовПлощадок.Количество() > 0,
		МассивИдентификаторовПлощадок, Неопределено));
	Результат.Вставить("maxPriceFrom", ?(НачальнаяЦенаОт > 0, НачальнаяЦенаОт, Неопределено));
	Результат.Вставить("maxPriceTo", ?(НачальнаяЦенаДо > 0, НачальнаяЦенаДо, Неопределено));
	Результат.Вставить("maxPriceNone", ВключатьЗакупкиБезНМЦ);
	Результат.Вставить("advance44", Авансирование44);
	Результат.Вставить("advance223", Авансирование223);
	Результат.Вставить("smp", ПреимуществаСМП);
		// приводим к MSK времени
		// клиент ожидает увидеть закупки по московскому
	Результат.Вставить("dateTimeFrom", КонтурЗакупки_СлужебныеВызовСервера.ПолучитьУниверсальнуюДатуВремяСтрокой(
		НачалоДня(
			НачалоПериода), "GMT+3"));
	Результат.Вставить("dateTimeTo", КонтурЗакупки_СлужебныеВызовСервера.ПолучитьУниверсальнуюДатуВремяСтрокой(
		КонецДня(
			КонецПериода), "GMT+3"));
	Если СтраницаЗначение > 1 Тогда
		Результат.Вставить("pageNumber", СтраницаЗначение - 1);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Найти закупки оффлайн.
Процедура НайтиЗакупкиОффлайн() Экспорт

	МассивНаЗагрузку = ЗакупкиНаЗагрузку.Выгрузить().ВыгрузитьКолонку("ИдентификаторЗакупки");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.ИдентификаторЗакупки КАК ИдентификаторЗакупки,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.НомерЗакупкиНаЭТП КАК НомерЗакупкиНаЭТП,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.СпособОтбора КАК СпособОтбора,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.ТипЗакупки КАК ТипЗакупки,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.НМЦ КАК НМЦ,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.Валюта КАК Валюта,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.СсылкаНаЭТП КАК СсылкаНаЭТП,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.СсылкаНаКЗ КАК СсылкаНаКЗ,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.ДатаОкончанияПодачиЗаявок КАК ДатаОкончанияПодачиЗаявок,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.ЗакупкаОтменена КАК ЗакупкаОтменена,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.ДатаПубликации КАК ДатаПубликации,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.НазваниеЗакупки КАК НазваниеЗакупки,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.Загружен КАК Загружен,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.СсылкаНаЗагруженный КАК СсылкаНаЗагруженный,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.ИННЗаказчиковИОрганизаторов КАК ИННЗаказчиковИОрганизаторов,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.МестаПоставки КАК МестаПоставки,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.Сниппеты КАК Сниппеты,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.ИдентификаторЗакупки В (&МассивНаЗагрузку) КАК Загружать,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.СниппетыДляОтображения КАК СниппетыДляОтображения,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.Участники,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.ДатаПодведенияИтогов,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.ЗакупкаНеСостоялась,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.ЗакупкаПланируется,
	|	КонтурЗакупки_СохраненныеРезультатыПоиска.УчастникиКоличество
	|ИЗ
	|	РегистрСведений.КонтурЗакупки_СохраненныеРезультатыПоиска КАК КонтурЗакупки_СохраненныеРезультатыПоиска
	|ГДЕ
	|	&ПодстановкаШаблонПоиска
	|	И КонтурЗакупки_СохраненныеРезультатыПоиска.ДатаПубликации МЕЖДУ &НачалоПериодаОффлайн И &КонецПериодаОффлайн";

	Запрос.УстановитьПараметр("МассивНаЗагрузку", МассивНаЗагрузку);
	Если ЗначениеЗаполнено(ШаблонПоиска) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПодстановкаШаблонПоиска",
			"КонтурЗакупки_СохраненныеРезультатыПоиска.ШаблонПоиска = &ШаблонПоискаОффлайн");
		Запрос.УстановитьПараметр("ШаблонПоискаОффлайн", ШаблонПоискаОффлайн);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПодстановкаШаблонПоиска", "ИСТИНА");
	КонецЕсли;

	Запрос.УстановитьПараметр("НачалоПериодаОффлайн", НачалоДня(НачалоПериодаОффлайн));
	Запрос.УстановитьПараметр("КонецПериодаОффлайн", КонецДня(КонецПериодаОффлайн));

	РезультатыПоиска.Загрузить(Запрос.Выполнить().Выгрузить());
		// уберем постраничную навигацию
	ЗаписейВсего = РезультатыПоиска.Количество();
	ЗаписейНаСтраницу = ЗаписейВсего;
	СтраницаТекущая = 1;
	СтраницВсего = 1;
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Обновить признак загрузки и ссылку.
Процедура ОбновитьПризнакиЗагрузкиИСсылки() Экспорт
	Для Каждого СтрокаЗакупки Из РезультатыПоиска Цикл
		СтруктураЗагружена = КонтурЗакупки_РаботаСЗакупкамиСервер.ЗакупкаЗагружена(
				СтрокаЗакупки.ИдентификаторЗакупки);
		ЗаполнитьЗначенияСвойств(СтрокаЗакупки, СтруктураЗагружена);
		СтрокаЗакупки.Загружать = ЗакупкаНаЗагрузку(СтрокаЗакупки.ИдентификаторЗакупки);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеЗаказчиковПоМассивуИНН(МассивИНН)
	
	Результат = "";
	
	КоличествоИНН = МассивИНН.Количество();
	
	Для Индекс = 0 По КоличествоИНН - 1 Цикл
		
		ИНН = МассивИНН[Индекс];
		ПараметрыОтбора = Новый Структура("ИНН", ИНН);
		НайденныеСтроки = Заказчики.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			МассивИНН[Индекс] = СтрШаблон("%1 (%2)", НайденныеСтроки[0].Наименование, ИНН);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = СтрСоединить(МассивИНН, ", ");
	
	Возврат Результат;
	
КонецФункции

Функция ИзменитьТегиНазванияЗакупкиИСниппетов(НазваниеЗакупки, ЗаменяемыйСимвол = "")
	НазваниеЗакупкиБезТегов = НазваниеЗакупки;

	НазваниеЗакупкиБезТегов = СтрЗаменить(НазваниеЗакупкиБезТегов, "[b]", ЗаменяемыйСимвол);
	НазваниеЗакупкиБезТегов = СтрЗаменить(НазваниеЗакупкиБезТегов, "[/b]", ЗаменяемыйСимвол);

	Возврат НазваниеЗакупкиБезТегов;
КонецФункции

Функция ЗакупкаНаЗагрузку(ИДЗакупки)
	СтрукОтбор = Новый Структура("ИдентификаторЗакупки", ИДЗакупки);

	МассивСтрок = ЗакупкиНаЗагрузку.НайтиСтроки(СтрукОтбор);

	Возврат МассивСтрок.Количество() > 0;
КонецФункции

Процедура ЗаполнитьСтрокуРезутьтата(СтрукРезультата)
	НовСтр = РезультатыПоиска.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр, СтрукРезультата);
	Если Не СтрукРезультата["МассивСниппеты"] = Неопределено Тогда
		Для Каждого Сниппет Из СтрукРезультата["МассивСниппеты"] Цикл
			НовСтрСниппеты = Сниппеты.Добавить();
			НовСтрСниппеты.ИдентификаторЗакупки = СтрукРезультата.ИдентификаторЗакупки;
			НовСтрСниппеты.Сниппет = Сниппет;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьЗаписьРегистраСоханенныеРезультатыПоиска(СтрукРезультата)
	Набор = РегистрыСведений.КонтурЗакупки_СохраненныеРезультатыПоиска.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторЗакупки.Установить(СтрукРезультата.ИдентификаторЗакупки, Истина);
	НовЗапись = Набор.Добавить();
	ЗаполнитьЗначенияСвойств(НовЗапись, СтрукРезультата);
	Набор.Записать();
КонецПроцедуры

#Область ФормированиеДанныхЗапроса

Функция ПолучитьМассивОтраслей()
	МассивОтраслей = Новый Массив;

	Для Каждого СтрокаОтраслей Из Отрасли Цикл
		МассивОтраслей.Добавить(СтрокаОтраслей.Отрасль.Код);
	КонецЦикла;

	Возврат МассивОтраслей;
КонецФункции

Функция ПолучитьМассивОтраслейОбновленных()
	МассивОтраслей = Новый Массив;

	Для Каждого СтрокаОтраслей Из ОтраслиОбновленные Цикл
		МассивОтраслей.Добавить(СтрокаОтраслей.Отрасль.Код);
	КонецЦикла;

	Возврат МассивОтраслей;
КонецФункции

Функция ПолучитьМассивЭтапов()
	МассивЭтапов = Новый Массив;

	Если ЭтапПодачаЗаявок Тогда
		МассивЭтапов.Добавить(1);
	КонецЕсли;

	Если ЭтапРаботаКомиссии Тогда
		МассивЭтапов.Добавить(2);
	КонецЕсли;

	Если ЭтапЗавершены Тогда
		Если ЭтапТолькоНесостоявшиеся Тогда
			МассивЭтапов.Добавить(6);
		Иначе
			МассивЭтапов.Добавить(3);
		КонецЕсли;
	КонецЕсли;

	Если ЭтапПланируются Тогда
		МассивЭтапов.Добавить(4);
	КонецЕсли;

	Если ЭтапОтменены Тогда
		МассивЭтапов.Добавить(5);
	КонецЕсли;

	Возврат МассивЭтапов;
КонецФункции

Функция ПолучитьМассивТиповТоргов()
	МассивТиповТоргов = Новый Массив;

	Если ТипТоргов44ФЗ Тогда
		МассивТиповТоргов.Добавить(1);
	КонецЕсли;

	Если ТипТоргов223ФЗ Тогда
		МассивТиповТоргов.Добавить(2);
	КонецЕсли;

//		Если ТипТорговКоммерческиеИМалые Тогда
//			МассивТиповТоргов.Добавить(3);
//		КонецЕсли;

	Если ТипТоргов615ПП Тогда
		МассивТиповТоргов.Добавить(5);
	КонецЕсли;

	Если ТипТорговКоммерческие Тогда
		МассивТиповТоргов.Добавить(8);
	КонецЕсли;

	Если ТипТорговМалые Тогда
		МассивТиповТоргов.Добавить(9);
	КонецЕсли;

	Возврат МассивТиповТоргов;
КонецФункции

Функция ПолучитьМассивСпособовОтбора()
	МассивСпособовОтбора = Новый Массив;

	Если СпособОтбораЭлектронныйАукцион Тогда
		МассивСпособовОтбора.Добавить(0);
	КонецЕсли;

	Если СпособОтбораЗапросКотировок Тогда
		МассивСпособовОтбора.Добавить(1);
	КонецЕсли;

	Если СпособОтбораЗакупкаУЕдинственногоПоставщика Тогда
		МассивСпособовОтбора.Добавить(2);
	КонецЕсли;

	Если СпособОтбораКонкурс Тогда
		МассивСпособовОтбора.Добавить(3);
	КонецЕсли;

	Если СпособОтбораЗапросИлиМониторингЦен Тогда
		МассивСпособовОтбора.Добавить(5);
	КонецЕсли;

	Если СпособОтбораДругиеСпособы Тогда
		МассивСпособовОтбора.Добавить(99);
	КонецЕсли;

	Возврат МассивСпособовОтбора;
КонецФункции
#КонецОбласти
#КонецОбласти
#КонецЕсли
